load-tests/artillery.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  processor: "./processor.js"
  defaults:
    headers:
      Content-Type: "application/json"

  phases:
    - name: "Warm up"
      duration: 10
      arrivalRate: 2
    - name: "Ramp up"
      duration: 60
      arrivalRate: 2
      rampTo: 80
    - name: "Sustained load"
      duration: 120
      arrivalRate: 80
    - name: "Peak"
      duration: 60
      arrivalRate: 80
      rampTo: 240
    - name: "Cool down"
      duration: 30
      arrivalRate: 240
      rampTo: 2

  # Fail the run if these thresholds are breached.
  ensure:
    thresholds:
      - http.response_time.p99: 500
      - http.response_time.p95: 200
    conditions:
      - expression: "http.codes.4xx < 50"
        strict: true
      - expression: "http.codes.5xx == 0"
        strict: true

scenarios:
  # --- Happy path: new user signs up, logs in, and exercises the API ---
  - name: "Full auth flow"
    weight: 7
    flow:
      - function: "generateUser"

      - post:
          url: "/signup"
          json:
            email: "{{ email }}"
            username: "{{ username }}"
            password: "{{ password }}"
            firstname: "Load"
            lastname: "Test"
          capture:
            - json: "$.user_id"
              as: "user_id"
          expect:
            - statusCode: 201

      - post:
          url: "/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200

      - get:
          url: "/check_permissions"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            service: "gatekeeper"
            resource: "gatekeeper/users/{{ user_id }}"
            action: "getUser"
          expect:
            - statusCode: 200
            - hasProperty: "authorized"

      - get:
          url: "/users/{{ user_id }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
            - hasProperty: "user_id"

      - put:
          url: "/users/{{ user_id }}"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            email: "{{ email }}"
            username: "{{ username }}"
            firstname: "Updated"
            lastname: "Load"
          expect:
            - statusCode: 200

  # --- Auth rejection paths: validates the server handles bad input under load ---
  - name: "Wrong password returns 401"
    weight: 2
    flow:
      - function: "generateUser"

      - post:
          url: "/signup"
          json:
            email: "{{ email }}"
            username: "{{ username }}"
            password: "{{ password }}"
          expect:
            - statusCode: 201

      - post:
          url: "/login"
          json:
            email: "{{ email }}"
            password: "wrongpassword"
          expect:
            - statusCode: 401

  # --- Unauthenticated requests: should be rejected cheaply at the middleware layer ---
  - name: "No token returns 401"
    weight: 1
    flow:
      - get:
          url: "/users/00000000-0000-0000-0000-000000000000"
          expect:
            - statusCode: 401